{
  "name": "Rogerio Palmares",
  "label": "Network Engineer",
  "image_path": "img/default-image.png",
  "contact": {
    "email": "",
    "phone": "",
    "location": "Dublin, Leinster, Ireland"
  },
  "summary": "Network Engineering, Automation, and Cloud",
  "base_url": "127.0.0.1:5500",
  "social_links": [
    {
      "label": "Personal Website",
      "url": "https://pingautomaterepeat.blogspot.com/",
      "svg_path": "img/globe.svg"
    },
    {
      "label": "First Social",
      "url": "https://www.linkedin.com/in/rogeriopalmares/",
      "svg_path": "img/linkedin.svg"
    },
    {
      "label": "Second Social",
      "url": "https://github.com/rogeriojrpalmares",
      "svg_path": "img/github.svg"
    }
  ],
  "work_experience": [
    {
      "company": "Dublin City University",
      "position": "Sr Network Engineer",
      "url": "https://dcu.ie",
      "start_date": "2023",
      "end_date": "Present",
      "summary": "",
      "highlights": [
        "Led enterprise-wide migration from legacy VPN to Zero Trust Network Access (ZTNA) across multi-campus university infrastructure, deploying secure access solutions to protect critical assets and enable seamless remote connectivity for 1,000+ users.",
        "Developed comprehensive network automation framework using REST APIs, Postman for API testing/validation, Python scripting with Jinja2 templating, and GitLab for version control, streamlining configuration management across multi-vendor environments.",
        "Automated FortiGate firewall configuration generation and deployment workflows, reducing manual setup time by 70%+ and minimizing configuration errors through templated Python scripts and API orchestration.",
        "Created \"Network Hub\" centralized dashboard providing single-pane visibility into automation scripts execution, SSL certificate expiration monitoring/alerting, and real-time observability metrics for proactive infrastructure management.",
        "Managed multi-vendor enterprise network infrastructure including Juniper QFX/EX switches, SRX edge firewalls, A10 WAF/load balancers, and DNS systems (EfficientIP, Route53) for high-availability campus operations.",
        "Led deployment of Network Access Control (NAC) solution across enterprise wired network, integrating Juniper EX switches, Aruba ClearPass, and Azure Intune for comprehensive compliance verification."
      ]
    },
    {
      "company": "Workhuman",
      "position": "Cloud Network Engineer",
      "url": "https://workhuman.com",
      "start_date": "2022",
      "end_date": "2023",
      "summary": "",
      "highlights": [
        "Achieved substantial cost savings across multiple AWS accounts (DEV/Preprod/Prod) by deploying AWS Cost Optimization dashboards, executing efficient migrations of hundreds of EBS volumes and EC2 instances, and rightsizing 20+ S3 Storage Classes.",
        "Served as primary technical escalation resource for Software Development teams, proactively diagnosing and resolving complex networking issues across AWS, OCI, and Megaport to ensure uninterrupted availability of critical web applications and databases.",
        "Implemented infrastructure-as-code (IaC) solutions using Terraform and CloudFormation for automated provisioning of VPCs, Transit Gateways, subnets, security groups, NACLs, Network Load Balancers, AWS Network Firewall, WAF rulesets across dev/test/prod environments.",
        "Implemented scalable serverless security solution replacing VPN dependencies, leveraging Lambda@Edge for real-time authentication decisions, reducing latency and eliminating client VPN software requirements for end users."
      ]
    },
    {
      "company": "Amazon Web Services (AWS)",
      "position": "Cloud Support Engineer / Technical Account Manager",
      "url": "https://aws.amazon.com/",
      "start_date": "2020",
      "end_date": "2022",
      "summary": "",
      "highlights": [
        "Recognized as the go-to Direct Connect Subject Matter Expert (SME) in AWS Premium Support, handling complex escalations, providing authoritative technical guidance, and driving product improvements through operational insights and customer feedback.",
        "Authored 12 internal technical articles and conducted 8 trainings on AWS Services and networking technologies, resulting in over 200 views across the organization.",
        "Leveraged expertise in AWS Networking Services, including AWS VPN, Client VPN, Direct Connect, VPC,Network Firewall, Global Accelerator, Elastic Load Balancers, Route53 (DNS), and others, to support and assist customers in building and maintaining robust network infrastructures.",
        "Developed Python Boto3 scripts and CloudFormation templates for automated test environment provisioning, enabling rapid Proof of Concept deployments for customers and accelerating cloud adoption timelines.",
        "Provided valuable architectural advice, support strategies, and launch planning guidance to Fortune 100 customers, ensuring successful cloud implementations and seamless operational continuity.",
        "Conducted comprehensive reviews of service disruptions, metrics, and detailed pre-launch planning, providing architectural guidance and actionable recommendations to enhance system reliability, performance, and customer operational success."
      ]
    },
    {
      "company": "Logicalis",
      "position": "Network Engineer",
      "url": "https://www.la.logicalis.com",
      "start_date": "2022",
      "end_date": "2023",
      "summary": "",
      "highlights": [
        "Implemented multiple projects encompassing the design, migration, and deployment of Cisco switches (Catalyst/Nexus), Routers (ASR/ISR), Servers (Cisco UCS and Dell PowerEdge), Virtualization (VMware/KVM), Linux (Red Hat), and F5 Load Balancers.",
        "Authored comprehensive implementation plans, High-Level Design (HLD), and Low-Level Design (LLD) documents, ensuring seamless project execution and adherence to industry best practices",
        "Deployed a Python-based automation solution to streamline the creation of start-up scripts for F5 load balancers, resulting in a significant reduction in time and effort for over 30 Data Center Engineers across the organization",
        "Worked directly with 10+ enterprise customers, leveraging strong interpersonal skills to gather and analyze network traffic patterns, constraints, and expected results, leading to the successful delivery of projects"
      ]
    }
  ],
  "projects": [
    {
      "title": "",
      "summary": "",
      "url": "",
      "highlights": [
        "",
        ""
      ],
      "images": [
        {
          "img_path": "",
          "caption": ""
        },
        {
          "img_path": "",
          "caption": ""
        }
      ]
    },
    {
      "title": "",
      "summary": "",
      "url": "",
      "highlights": [
        "",
        "",
        ""
      ],
      "images": [
        {
          "img_path": "",
          "caption": ""
        }
      ]
    }
  ],
  "volunteer_experience": [
    {
      "organization": "National Society of Black Engineers (NSBE)",
      "position": "Member",
      "url": "https://nsbe.org/",
      "start_date": "2014",
      "end_date": "2015",
      "summary": "",
      "highlights": [
        "",
        "",
        ""
      ]
    },
    {
      "organization": "New York Cares",
      "position": "Member",
      "url": "https://www.newyorkcares.org/",
      "start_date": "2015",
      "end_date": "2015",
      "summary": "Economy Professor Assistant for kids",
      "highlights": [
        "",
        "",
        ""
      ]
    }
  ],
  "education": [
    {
      "institution": "National College of Ireland",
      "location": "Dublin",
      "url": "https://www.ncirl.ie/",
      "degrees": [
        "Postgrad in CyberSecurity"
      ],
      "honors": ["Dinstinct"],
      "gpa_cumulative": "",
      "gpa_major": "",
      "graduation_date": "2024"
    },
    {
      "institution": "New York Intistute of Technology",
      "location": "New York",
      "url": "https://www.nyit.edu/",
      "degrees": ["Bachelor of Telecommunications Management"],
      "honors": [""],
      "gpa_cumulative": "",
      "gpa_major": "",
      "graduation_date": "2015"
    },
    {
      "institution": "Universidade Federal Fluminense (UFF)",
      "location": "Rio de Janeiro",
      "url": "https://www.uff.br/",
      "degrees": ["Bachelor of Telecommunications Engineering"],
      "honors": [""],
      "gpa_cumulative": "",
      "gpa_major": "",
      "graduation_date": "2017"
    }
  ],
  "skills": [
    {
    },
    {
    }
  ],
  "interests": [
    {
      "name": "Musician",
      "summary": "",
      "images": [
        {
          "img_path": "img/samba1.jpg",
          "caption": "Playing Samba at a local event"
        }
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Portuguese (Brazilian)",
      "fluency": "Native Speaker"
    },
    {
      "language": "Spanish",
      "fluency": "Intermediate"
    }
  ],
  "references": [
    {
      "name": "",
      "relation": "",
      "reference": ""
    }
  ]
}
